src/cf/Documents/СправкаНДФЛУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СправкаНДФЛУНФ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКАТО_КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправкуПодписал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПодписавшегоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавкиУНФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОблагаемаяСуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исчислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзлишнеУдержано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удержано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перечислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗарубежом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусНалогоплательщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыНалогоплательщиковПоНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОрганаПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СведенияОДоходах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КодыДоходовНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВычета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВычета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СведенияОВычетах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодВычета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВычета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СуммыНалогов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НДФЛСтавкиУНФ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСуммаДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОблагаемаяСуммаДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исчислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удержано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перечислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзлишнеУдержано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УведомленияНОоПравеНаВычеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаУведомления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерУведомления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодНалоговогоОрганаУведомления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаВычета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ГруппыВычетовПоНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/СправкаНДФЛУНФ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПроцедурыИФункцииПечати

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Устанавливаем признак доступности печати покомплектно
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	// Проверяем, нужно ли для макета формировать табличный документ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Справки2НДФЛ") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Справки2НДФЛ",
			"Справка 2-НДФЛ для сотрудника", СформироватьПечатнуюФорму2НДФЛ(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

КонецПроцедуры


// Функция формирует табличный документ с печатной формой справки 2-НДФЛ
//
// Возвращаемое значение:
//  Табличный документ - печатная форма справки 2-НДФЛ
//
Функция СформироватьПечатнуюФорму2НДФЛ(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ДанныеНА = СправкиПоНДФЛ.СправкиНДФЛДанныеДляПечати(МассивОбъектов);
	ТаблицыДокумента = ТаблицыДанныхДокументаДляПечати(МассивОбъектов);
	Возврат СправкиПоНДФЛ.СформироватьПечатнуюФорму2НДФЛ(ОбъектыПечати, МассивОбъектов, ДанныеНА, ТаблицыДокумента.Сотрудники, ТаблицыДокумента.СведенияОДоходах, ТаблицыДокумента.СведенияОВычетах, ТаблицыДокумента.Уведомления); 
	
КонецФункции

// Заполняет список команд печати Справка 2-НДФЛ
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОтчетность") Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "Справки2НДФЛ";
		КомандаПечати.Представление = НСтр("ru = 'Справка 2-НДФЛ для сотрудника'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 1;
	КонецЕсли;
	
КонецПроцедуры

#Область ВспомогательныеПроцедурыИФункции

Функция ТаблицыДанныхДокументаДляПечати(Ссылка)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	// АПК:1036-выкл
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправкаНДФЛУНФ.Ссылка КАК Ссылка,
	|	СправкаНДФЛУНФ.ВерсияДанных КАК ВерсияДанных,
	|	СправкаНДФЛУНФ.ПометкаУдаления КАК ПометкаУдаления,
	|	СправкаНДФЛУНФ.Номер КАК НомерСправки,
	|	СправкаНДФЛУНФ.Дата КАК Дата,
	|	СправкаНДФЛУНФ.Проведен КАК Проведен,
	|	СправкаНДФЛУНФ.НалоговыйПериод КАК НалоговыйПериод,
	|	СправкаНДФЛУНФ.Организация КАК Организация,
	|	СправкаНДФЛУНФ.ОКАТО_КПП КАК ОКАТО_КПП,
	|	СправкаНДФЛУНФ.Телефон КАК Телефон,
	|	СправкаНДФЛУНФ.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	СправкаНДФЛУНФ.СправкуПодписал КАК СправкуПодписал,
	|	СправкаНДФЛУНФ.ДолжностьПодписавшегоЛица КАК ДолжностьПодписавшегоЛица,
	|	СправкаНДФЛУНФ.КраткийСоставДокумента КАК КраткийСоставДокумента,
	|	СправкаНДФЛУНФ.Ответственный КАК Ответственный,
	|	СправкаНДФЛУНФ.Комментарий КАК Комментарий,
	|	СправкаНДФЛУНФ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаНДФЛУНФ.Ставка КАК Ставка,
	|	СправкаНДФЛУНФ.Сотрудник КАК Сотрудник,
	|	СправкаНДФЛУНФ.Фамилия КАК Фамилия,
	|	СправкаНДФЛУНФ.Имя КАК Имя,
	|	СправкаНДФЛУНФ.Отчество КАК Отчество,
	|	СправкаНДФЛУНФ.АдресРФ КАК АдресРФ,
	|	СправкаНДФЛУНФ.ВидДокумента КАК ВидДокумента,
	|	СправкаНДФЛУНФ.СерияДокумента КАК СерияДокумента,
	|	СправкаНДФЛУНФ.НомерДокумента КАК НомерДокумента,
	|	СправкаНДФЛУНФ.ДатаРождения КАК ДатаРождения,
	|	СправкаНДФЛУНФ.ИНН КАК ИНН,
	|	СправкаНДФЛУНФ.Гражданство КАК Гражданство,
	|	СправкаНДФЛУНФ.АдресЗарубежом КАК АдресЗарубежом,
	|	СправкаНДФЛУНФ.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	ЕСТЬNULL(СуммыНалоговСотрудники.ОбщаяСуммаДохода, 0) КАК ОбщаяСуммаДохода,
	|	ЕСТЬNULL(СуммыНалоговСотрудники.ОблагаемаяСуммаДохода, 0) КАК ОблагаемаяСуммаДохода,
	|	ЕСТЬNULL(СуммыНалоговСотрудники.Исчислено, 0) КАК Исчислено,
	|	ЕСТЬNULL(СуммыНалоговСотрудники.Удержано, 0) КАК Удержано,
	|	ЕСТЬNULL(СуммыНалоговСотрудники.Задолженность, 0) КАК Задолженность,
	|	ЕСТЬNULL(СуммыНалоговСотрудники.ИзлишнеУдержано, 0) КАК ИзлишнеУдержано,
	|	ЕСТЬNULL(СуммыНалоговСотрудники.Перечислено, 0) КАК Перечислено
	|ИЗ
	|	Документ.СправкаНДФЛУНФ КАК СправкаНДФЛУНФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СправкаНДФЛУНФ.СуммыНалогов КАК СуммыНалоговСотрудники
	|		ПО (СуммыНалоговСотрудники.Ссылка = СправкаНДФЛУНФ.Ссылка)
	|ГДЕ
	|	СправкаНДФЛУНФ.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправкаНДФЛСведенияОДоходах.Ссылка КАК Ссылка,
	|	СправкаНДФЛСведенияОДоходах.НомерСтроки КАК НомерСтроки,
	|	СправкаНДФЛСведенияОДоходах.Месяц КАК МесяцНалоговогоПериода,
	|	СправкаНДФЛСведенияОДоходах.КодДохода КАК КодДохода,
	|	СправкаНДФЛСведенияОДоходах.СуммаДохода КАК СуммаДохода,
	|	СправкаНДФЛСведенияОДоходах.КодВычета КАК КодВычета,
	|	СправкаНДФЛСведенияОДоходах.СуммаВычета КАК СуммаВычета,
	|	СправкаНДФЛСведенияОДоходах.Ссылка.Номер КАК НомерСправки
	|ИЗ
	|	Документ.СправкаНДФЛУНФ.СведенияОДоходах КАК СправкаНДФЛСведенияОДоходах
	|ГДЕ
	|	СправкаНДФЛСведенияОДоходах.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправкаНДФЛСведенияОВычетах.Ссылка КАК Ссылка,
	|	СправкаНДФЛСведенияОВычетах.НомерСтроки КАК НомерСтроки,
	|	СправкаНДФЛСведенияОВычетах.КодВычета КАК КодВычета,
	|	СправкаНДФЛСведенияОВычетах.КодВычета.ГруппаВычета КАК ГруппаВычета,
	|	СправкаНДФЛСведенияОВычетах.СуммаВычета КАК СуммаВычета,
	|	СправкаНДФЛСведенияОВычетах.Ссылка.Номер КАК НомерСправки
	|ИЗ
	|	Документ.СправкаНДФЛУНФ.СведенияОВычетах КАК СправкаНДФЛСведенияОВычетах
	|ГДЕ
	|	СправкаНДФЛСведенияОВычетах.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправкаНДФЛСуммыНалогов.Ссылка КАК Ссылка,
	|	СправкаНДФЛСуммыНалогов.НомерСтроки КАК НомерСтроки,
	|	СправкаНДФЛСуммыНалогов.Ссылка.Номер КАК НомерСправки,
	|	СправкаНДФЛСуммыНалогов.Ставка КАК Ставка,
	|	СправкаНДФЛСуммыНалогов.ОбщаяСуммаДохода КАК ОбщаяСуммаДохода,
	|	СправкаНДФЛСуммыНалогов.ОблагаемаяСуммаДохода КАК ОблагаемаяСуммаДохода,
	|	СправкаНДФЛСуммыНалогов.Исчислено КАК Исчислено,
	|	СправкаНДФЛСуммыНалогов.Удержано КАК Удержано,
	|	СправкаНДФЛСуммыНалогов.Перечислено КАК Перечислено,
	|	СправкаНДФЛСуммыНалогов.ИзлишнеУдержано КАК ИзлишнеУдержано,
	|	СправкаНДФЛСуммыНалогов.Задолженность КАК Задолженность
	|ИЗ
	|	Документ.СправкаНДФЛУНФ.СуммыНалогов КАК СправкаНДФЛСуммыНалогов
	|ГДЕ
	|	СправкаНДФЛСуммыНалогов.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Уведомления.Ссылка КАК Ссылка,
	|	Уведомления.Ссылка.Номер КАК НомерСправки,
	|	Уведомления.НомерСтроки КАК НомерСтроки,
	|	Уведомления.ДатаУведомления КАК ДатаУведомления,
	|	Уведомления.НомерУведомления КАК НомерУведомления,
	|	Уведомления.КодНалоговогоОрганаУведомления КАК КодНалоговогоОрганаУведомления,
	|	Уведомления.ГруппаВычета КАК ГруппаВычета
	|ИЗ
	|	Документ.СправкаНДФЛУНФ.УведомленияНОоПравеНаВычеты КАК Уведомления";
	// АПК:1036-вкл
	Результаты = Запрос.ВыполнитьПакет();
	
	Возврат Новый Структура("Сотрудники, СведенияОДоходах, СведенияОВычетах, СведенияОбИтогах, Уведомления", Результаты[0].Выгрузить(), Результаты[1].Выгрузить(), Результаты[2].Выгрузить(), Результаты[3].Выгрузить(), Результаты[4].Выгрузить());
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
